In [5]:
#Load the dataset in Pandas.
import pandas as pd

file = pd.read_csv("C:\\Users\\XNovaQ.18\\Downloads\\students_assignment_data(students_assignment_data).csv")

In [6]:
file

      StudentID             Name  Age Gender  Total_Marks       City
0          1001  Timothy Mendoza   14      M        365.0      Delhi
1          1002   Taylor Jackson   14      F        327.0      Delhi
2          1003   Erica Lawrence   13      F        343.0  Bangalore
3          1004    Rachel Murray   15      M        289.0    Kolkata
4          1005      Jesse Horne   17      M        356.0  Bangalore
...         ...              ...  ...    ...          ...        ...
1495       2496      Mark Horton   18      F        296.0    Kolkata
1496       2497    Lisa Johnston   14      F        223.0  Bangalore
1497       2498  Denise Campbell   16      M        258.0     Mumbai
1498       2499    Angel Sanders   18      M        240.0    Chennai
1499       2500  Virginia Warren   13      F        187.0    Chennai

[1500 rows x 6 columns]

In [8]:
#Display first 15 rows, data types, and dataset shape.

print("First 15 \n")
print(file.head(15))

print("Data type \n")
print(file.dtypes)

print("Dataset shape \n")
print(file.shape)

First 15

    StudentID                Name  Age Gender  Total_Marks       City
0        1001     Timothy Mendoza   14      M        365.0      Delhi
1        1002      Taylor Jackson   14      F        327.0      Delhi
2        1003      Erica Lawrence   13      F        343.0  Bangalore
3        1004       Rachel Murray   15      M        289.0    Kolkata
4        1005         Jesse Horne   17      M        356.0  Bangalore
5        1006      Priscilla Cook   18      F        411.0     Mumbai
6        1007     James Jefferson   16      M        357.0    Kolkata
7        1008     Cynthia Leonard   18      M        263.0    Chennai
8        1009        Audrey Allen   13      F        285.0      Delhi
9        1010    Jeffrey Campbell   18      M        315.0  Bangalore
10       1011      Ryan Jefferson   15      M        284.0      Delhi
11       1012    Christina Wilson   18      M        350.0      Delhi
12       1013    Brittany Sanchez   17      F        342.0    Chennai
13       1014  Christopher Wagner   16      F        240.0    Chennai
14       1015          Kyle Blake   15      M        341.0      Delhi
Data type

StudentID        int64
Name            object
Age              int64
Gender          object
Total_Marks    float64
City            object
dtype: object
Dataset shape

(1500, 6)

In [13]:
#Identify unique cities and count of students per city.

print("Unique cities \n")
print(file['City'].unique)

print("Count city \n")
print(file['City'].value_counts)

Unique cities

<bound method Series.unique of 0           Delhi
1           Delhi
2       Bangalore
3         Kolkata
4       Bangalore
          ...
1495      Kolkata
1496    Bangalore
1497       Mumbai
1498      Chennai
1499      Chennai
Name: City, Length: 1500, dtype: object>
Count city

<bound method IndexOpsMixin.value_counts of 0           Delhi
1           Delhi
2       Bangalore
3         Kolkata
4       Bangalore
          ...
1495      Kolkata
1496    Bangalore
1497       Mumbai
1498      Chennai
1499      Chennai
Name: City, Length: 1500, dtype: object>

In [15]:
#Filter and display students with Total_Marks greater than or equal to 400.

high_scorers = file[file['Total_Marks'] >= 400]

print(high_scorers)

print(high_scorers[['StudentID', 'Name', 'City', 'Total_Marks']])

      StudentID            Name  Age Gender  Total_Marks       City
5          1006  Priscilla Cook   18      F        411.0     Mumbai
26         1027   Julian Martin   18      F        458.0  Bangalore
64         1065   Scott Collins   18      M        404.0    Chennai
65         1066      Jose Craig   18      F        401.0    Kolkata
72         1073     Travis Soto   14      M        486.0    Kolkata
...         ...             ...  ...    ...          ...        ...
1466       2467   Carrie George   16      F        433.0     Mumbai
1473       2474    Carlos Moore   16      M        406.0      Delhi
1480       2481    Leslie Smith   18      M        405.0  Bangalore
1484       2485  Melody Delgado   16      F        465.0      Delhi
1492       2493     Brian Pitts   14      M        424.0    Chennai

[132 rows x 6 columns]
      StudentID            Name       City  Total_Marks
5          1006  Priscilla Cook     Mumbai        411.0
26         1027   Julian Martin  Bangalore        458.0
64         1065   Scott Collins    Chennai        404.0
65         1066      Jose Craig    Kolkata        401.0
72         1073     Travis Soto    Kolkata        486.0
...         ...             ...        ...          ...
1466       2467   Carrie George     Mumbai        433.0
1473       2474    Carlos Moore      Delhi        406.0
1480       2481    Leslie Smith  Bangalore        405.0
1484       2485  Melody Delgado      Delhi        465.0
1492       2493     Brian Pitts    Chennai        424.0

[132 rows x 4 columns]

In [19]:
#Extract details of all female students and their scores.

gender = file[file['Gender'] == 'F']

print(gender[['StudentID', 'Name', 'City', 'Total_Marks']])

      StudentID              Name       City  Total_Marks
1          1002    Taylor Jackson      Delhi        327.0
2          1003    Erica Lawrence  Bangalore        343.0
5          1006    Priscilla Cook     Mumbai        411.0
8          1009      Audrey Allen      Delhi        285.0
12         1013  Brittany Sanchez    Chennai        342.0
...         ...               ...        ...          ...
1486       2487     Cassidy Craig     Mumbai        300.0
1490       2491       Ashley Hill  Bangalore        333.0
1495       2496       Mark Horton    Kolkata        296.0
1496       2497     Lisa Johnston  Bangalore        223.0
1499       2500   Virginia Warren    Chennai        187.0

[741 rows x 4 columns]

In [20]:
#Find the average Total_Marks grouped by Gender.

avg_mrk_gender = file.groupby('Gender')['Total_Marks'].mean()

print(avg_mrk_gender)

Gender
F    296.706920
M    303.449868
Name: Total_Marks, dtype: float64

In [21]:
#Group students by City and compute the average Total_Marks and the total count per city

city_status = file.groupby('City').agg(Average_Total_Marks=('Total_Marks', 'mean'),Student_Count=('City', 'count'))

print(city_status)

           Average_Total_Marks  Student_Count
City
Bangalore           301.895105            287
Chennai             304.613383            270
Delhi               299.372024            336
Kolkata             296.158416            305
Mumbai              299.269103            302

In [22]:
#Sort all students by Total_Marks in descending order.

sorted_students = file.sort_values(by='Total_Marks', ascending=False)

print(sorted_students)

      StudentID              Name  Age Gender  Total_Marks       City
400        1401       Ronald Lang   18      M        500.0    Chennai
1343       2344     Hannah Obrien   16      F        500.0  Bangalore
1208       2209    Nicole Cameron   18      M        500.0     Mumbai
1106       2107   Joseph Williams   16      F        497.0    Kolkata
437        1438  Ashley Hernandez   17      M        489.0    Chennai
...         ...               ...  ...    ...          ...        ...
41         1042      Daniel Baker   15      F          NaN  Bangalore
129        1130       Henry Walsh   17      M          NaN    Kolkata
198        1199  Douglas Reynolds   13      F          NaN    Kolkata
211        1212        Eric Jones   14      F          NaN     Mumbai
823        1824       Jason Fritz   17      F          NaN    Chennai

[1500 rows x 6 columns]

In [23]:
#Reset the index of the sorted DataFrame.

sorted_students = file.sort_values(by='Total_Marks', ascending=False)

sorted_students = sorted_students.reset_index(drop=True)

print(sorted_students)

      StudentID              Name  Age Gender  Total_Marks       City
0          1401       Ronald Lang   18      M        500.0    Chennai
1          2344     Hannah Obrien   16      F        500.0  Bangalore
2          2209    Nicole Cameron   18      M        500.0     Mumbai
3          2107   Joseph Williams   16      F        497.0    Kolkata
4          1438  Ashley Hernandez   17      M        489.0    Chennai
...         ...               ...  ...    ...          ...        ...
1495       1042      Daniel Baker   15      F          NaN  Bangalore
1496       1130       Henry Walsh   17      M          NaN    Kolkata
1497       1199  Douglas Reynolds   13      F          NaN    Kolkata
1498       1212        Eric Jones   14      F          NaN     Mumbai
1499       1824       Jason Fritz   17      F          NaN    Chennai

[1500 rows x 6 columns]

In [24]:
#Detect missing Total_Marks values (simulate by setting ~10% missing).

missing_marks = file[file['Total_Marks'].isna()]

print("Rows with Missing Total_Marks:\n")

print(missing_marks)

Rows with Missing Total_Marks:

     StudentID              Name  Age Gender  Total_Marks       City
41        1042      Daniel Baker   15      F          NaN  Bangalore
129       1130       Henry Walsh   17      M          NaN    Kolkata
198       1199  Douglas Reynolds   13      F          NaN    Kolkata
211       1212        Eric Jones   14      F          NaN     Mumbai
823       1824       Jason Fritz   17      F          NaN    Chennai

In [25]:
#Impute missing Total_Marks with the mean of the column.

mean_marks = file['Total_Marks'].mean()

file['Total_Marks'] = file['Total_Marks'].fillna(mean_marks)

print("Missing values after imputation:", file['Total_Marks'].isna().sum())

Missing values after imputation: 0

In [26]:
#Create a new column Result where students scoring >= 200 are marked as 'Pass', otherwise 'Fail'

file['Result'] = 'Fail'
file.loc[file['Total_Marks'] >= 200, 'Result'] = 'Pass'

print(file[['Total_Marks', 'Result']])

      Total_Marks Result
0           365.0   Pass
1           327.0   Pass
2           343.0   Pass
3           289.0   Pass
4           356.0   Pass
...           ...    ...
1495        296.0   Pass
1496        223.0   Pass
1497        258.0   Pass
1498        240.0   Pass
1499        187.0   Fail

[1500 rows x 2 columns]

In [27]:
#Count how many students failed and passed overall.

print(file['Result'].value_counts())

Result
Pass    1379
Fail     121
Name: count, dtype: int64

In [29]:
file.to_csv("students_cleaned.csv")